app/controllers/admin/articles_controller.rb

SELECT * FROM "articles"
---
        def index
                @articles = Article.all

INSERT INTO "articles" ("created_at", "title", "updated_at", "group_id", "content") VALUES('2010-11-02 14:19:54', 'Nowy artukulik', '2010-11-02 14:19:54', 3, 'Jestem adminem, więc mogę dodawać takie bzdury bez żadnych przeszkód.')
SELECT * FROM "groups"
---
        def create
                @article = Article.new(params[:article])
		if @article.save
			redirect_to(admin_article_path(@article), :notice => 'Article was successfully created.')
		else
			@groups = Group.all

SELECT * FROM "groups"
---
        def new
                @article = Article.new
		@groups = Group.all

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
        def show
		@article = Article.find(params[:id])

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "groups"
---
	def edit
		@article = Article.find(params[:id])
		@groups = Group.all

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2010-11-02 16:42:28', "content" = 'Jestem adminem, więc mogę dodawać takie bzdury bez żadnych przeszkód. Hej!' WHERE "id" = 1
---
        def update
		@article = Article.find(params[:id])
		if @article.update_attributes(params[:article])

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1
---
        def destroy
		@article = Article.find(params[:id])
		@article.destroy