app/controllers/admin/comments_controller.rb

	def new
		@comment = Article.find(params[:article_id]).comments.new
		@articles = Article.all
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "articles"

	def create
		article = Article.find(params[:article_id])
		@comment = article.comments.new(params[:comment])
		if @comment.save
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
INSERT INTO "comments" ("created_at", "author", "updated_at", "article_id", "content") VALUES('2010-11-02 17:25:48', 'TESTER', '2010-11-02 17:25:48', 1, 'Just, er, testing... :-D

	def destroy
		@comment = Comment.find(params[:id])
		@comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 7)
DELETE FROM "comments" WHERE "id" = 7