app/controllers/articles_controller.rb

        def index
                @articles = Article.all
---
SELECT * FROM "articles"

        def show
		@article = Article.find(params[:id])
 		group = Group.find(@article.group_id)
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "groups" WHERE ("groups"."id" = 3)