app/controllers/comments_controller.rb

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
	def new
		@comment = Article.find(params[:article_id]).comments.new

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
INSERT INTO "comments" ("created_at", "author", "updated_at", "article_id", "content") VALUES('2010-11-02 14:27:03', 'ADMIN', '2010-11-02 14:27:03', 1, 'heniek')
---
	def create
		article = Article.find(params[:article_id])
		@comment = article.comments.new(params[:comment])
		if @comment.save